# 格式化字符串适用于需要字符串具有一定格式时使用
# 需要使用占位符作为字符串中的可变部分，占位符有%[type]和{N}两种类型
# 第一种格式: "XXXX %s XXXX %d XXXX" % (val1,val2)                  将val1和val2分别填充到%s和%d的位置，%10s表示这个占位符宽度为10字符，不足的补空格，%.3f表示该占位符浮点数保留三位小数，%10.3f同时规定了宽度和精度
# 第二种格式: "XXXX {0} XXXX {1} XXXX {0}".format(val1,val2)        将第一个变量val1填充到所有占位符{0}处，第二个val2填充到{1}处，以此类推，{0:.3}表示三位有效数字，{0:.3f表示三位小数}，{0:10.3f}同时规定宽和精
# 第三种格式: F"XXXX {val1} XXXX {val2} XXXX"                       直接引用前面声明的变量

str1 = "我的名字是%s,我今年%d岁,%s"
str2 = "我的名字是{0},我今年{1}岁,{2}{2}{2}"
list1 = ["NEKO", "NICO", "张三", "小明", "元首", "瑟提"]
list2 = [22, 21, 15, 30, 133, 22]
list3 = ["我喜欢猫 ", "nico nico ni .. ", "法外狂徒 ", "今天又是我背锅 ", "爷的帝国~~呜~~ ", "我已经参透了符文 "]

print("-------------------------------------------第一种格式化输出方法")
for item in range(6):
    print(str1 % (list1[item], list2[item], list3[item]))

print("\n-------------------------------------------第二种格式化输出方法")
for item in range(6):
    print(str2.format(list1[item], list2[item], list3[item]))

print("\n-------------------------------------------第三种格式化输出方法")
for item in range(6):
    print(F"我的名字是{list1[item]},我今年{list2[item]}岁,{list3[item]}")
